Reports/ТурнирнаяТаблица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ТурнирнаяТаблица</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Чемпионат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Чемпионаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьРазницуМячей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/ТурнирнаяТаблица/Ext/ManagerModule.bsl
Функция ОтчетСформировать(Знач Чемпионат, ПоказыватьРазницуМячей=Ложь) Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	
	Выборка = СерверныйФункции.ТурнирнаяТаблица(Чемпионат);
	
	Макет  = ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Чемпионат	= Чемпионат;
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	НаВылет		= Выборка.Количество() - Чемпионат.Владелец.КоличествоРотация;
	НомерСтроки	= 0;
	Пятерка		= 0;
	Пока Выборка.Следующий() Цикл
		НомерСтроки	= НомерСтроки + 1;
		
		Если НомерСтроки > 5 Тогда
			Если НомерСтроки > НаВылет Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Пятерка");
				
			ИначеЕсли Пятерка = Выборка.КоличествоОчков Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Пятерка");
				ТабДокумент.ФиксацияСверху = 3 + НомерСтроки;
				
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Детали");
			КонецЕсли;
			
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("Пятерка");
			ТабДокумент.ФиксацияСверху = 3 + НомерСтроки;
			
			Пятерка = Выборка.КоличествоОчков;
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.Место	= НомерСтроки;
		Если НЕ ПоказыватьРазницуМячей Тогда
			ОбластьМакета.Параметры.Разница	= Строка(Выборка.Забито) + "-" + Строка(Выборка.Пропущено);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции
